{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"bias": true, "activity_regularizer": null, "b_regularizer": null, "dim_ordering": "tf", "input_dtype": "float32", "name": "conv1_0", "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "W_constraint": null, "nb_filter": 10, "nb_row": 10, "border_mode": "same", "nb_col": 10, "batch_input_shape": [null, 10, 10, 10], "b_constraint": null, "activation": "relu", "subsample": [1, 1]}}, {"class_name": "Convolution2D", "config": {"bias": true, "activity_regularizer": null, "b_regularizer": null, "dim_ordering": "tf", "name": "conv1_1", "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "W_constraint": null, "nb_filter": 10, "nb_row": 10, "border_mode": "same", "nb_col": 10, "b_constraint": null, "activation": "relu", "subsample": [1, 1]}}, {"class_name": "Convolution2D", "config": {"bias": true, "activity_regularizer": null, "b_regularizer": null, "dim_ordering": "tf", "name": "conv1_2", "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "W_constraint": null, "nb_filter": 10, "nb_row": 10, "border_mode": "same", "nb_col": 10, "b_constraint": null, "activation": "relu", "subsample": [1, 1]}}, {"class_name": "Convolution2D", "config": {"bias": true, "activity_regularizer": null, "b_regularizer": null, "dim_ordering": "tf", "name": "conv1_3", "init": "glorot_uniform", "trainable": true, "W_regularizer": null, "W_constraint": null, "nb_filter": 10, "nb_row": 10, "border_mode": "same", "nb_col": 10, "b_constraint": null, "activation": "relu", "subsample": [1, 1]}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "dim_ordering": "tf", "name": "maxpooling2d_23", "pool_size": [2, 2], "trainable": true, "border_mode": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_67"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_23"}}, {"class_name": "Dense", "config": {"W_constraint": null, "W_regularizer": null, "b_regularizer": null, "name": "dense_67", "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "input_dim": 250, "bias": true, "output_dim": 1000, "b_constraint": null, "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_68"}}, {"class_name": "Dense", "config": {"W_constraint": null, "W_regularizer": null, "b_regularizer": null, "name": "dense_68", "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "input_dim": 1000, "bias": true, "output_dim": 100, "b_constraint": null, "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_69"}}, {"class_name": "Dense", "config": {"W_constraint": null, "W_regularizer": null, "b_regularizer": null, "name": "dense_69", "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "input_dim": 100, "bias": true, "output_dim": 3, "b_constraint": null, "activation": "softmax"}}]}