{"config": [{"config": {"bias": true, "border_mode": "same", "input_dtype": "float32", "nb_filter": 10, "name": "conv1_0", "nb_row": 10, "batch_input_shape": [null, 10, 10, 10], "b_regularizer": null, "activity_regularizer": null, "activation": "relu", "W_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_col": 10, "b_constraint": null, "W_regularizer": null, "trainable": true, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"bias": true, "border_mode": "same", "nb_filter": 10, "name": "conv1_1", "nb_row": 10, "b_regularizer": null, "activity_regularizer": null, "activation": "relu", "W_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_col": 10, "b_constraint": null, "W_regularizer": null, "trainable": true, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"bias": true, "border_mode": "same", "nb_filter": 10, "name": "conv1_2", "nb_row": 10, "b_regularizer": null, "activity_regularizer": null, "activation": "relu", "W_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_col": 10, "b_constraint": null, "W_regularizer": null, "trainable": true, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"bias": true, "border_mode": "same", "nb_filter": 10, "name": "conv1_3", "nb_row": 10, "b_regularizer": null, "activity_regularizer": null, "activation": "relu", "W_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_col": 10, "b_constraint": null, "W_regularizer": null, "trainable": true, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"bias": true, "border_mode": "same", "nb_filter": 10, "name": "convolution2d_3", "nb_row": 10, "b_regularizer": null, "activity_regularizer": null, "activation": "relu", "W_constraint": null, "dim_ordering": "tf", "init": "glorot_uniform", "nb_col": 10, "b_constraint": null, "W_regularizer": null, "trainable": true, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2], "name": "maxpooling2d_3", "dim_ordering": "tf", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_7", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_3", "trainable": true}, "class_name": "Flatten"}, {"config": {"input_dim": null, "name": "dense_7", "b_regularizer": null, "activity_regularizer": null, "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "bias": true, "b_constraint": null, "output_dim": 1000, "trainable": true, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_8", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"input_dim": null, "name": "dense_8", "b_regularizer": null, "activity_regularizer": null, "activation": "relu", "W_constraint": null, "init": "glorot_uniform", "bias": true, "b_constraint": null, "output_dim": 100, "trainable": true, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_9", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"input_dim": null, "name": "dense_9", "b_regularizer": null, "activity_regularizer": null, "activation": "sigmoid", "W_constraint": null, "init": "glorot_uniform", "bias": true, "b_constraint": null, "output_dim": 1, "trainable": true, "W_regularizer": null}, "class_name": "Dense"}], "keras_version": "1.1.2", "class_name": "Sequential"}