{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Convolution3D", "config": {"bias": true, "W_regularizer": null, "b_regularizer": null, "dim_ordering": "tf", "name": "conv1_0", "input_dtype": "float32", "init": "glorot_uniform", "kernel_dim2": 10, "trainable": true, "activity_regularizer": null, "kernel_dim1": 10, "W_constraint": null, "nb_filter": 10, "border_mode": "same", "kernel_dim3": 10, "batch_input_shape": [null, 1, 10, 10, 10], "b_constraint": null, "activation": "relu", "subsample": [1, 1, 1]}}, {"class_name": "Convolution3D", "config": {"bias": true, "W_regularizer": null, "b_regularizer": null, "dim_ordering": "tf", "name": "conv1_1", "init": "glorot_uniform", "kernel_dim2": 10, "trainable": true, "activity_regularizer": null, "kernel_dim1": 10, "W_constraint": null, "nb_filter": 10, "border_mode": "same", "kernel_dim3": 10, "b_constraint": null, "activation": "relu", "subsample": [1, 1, 1]}}, {"class_name": "Convolution3D", "config": {"bias": true, "W_regularizer": null, "b_regularizer": null, "dim_ordering": "tf", "name": "conv1_2", "init": "glorot_uniform", "kernel_dim2": 10, "trainable": true, "activity_regularizer": null, "kernel_dim1": 10, "W_constraint": null, "nb_filter": 10, "border_mode": "same", "kernel_dim3": 10, "b_constraint": null, "activation": "relu", "subsample": [1, 1, 1]}}, {"class_name": "MaxPooling3D", "config": {"strides": [2, 2, 2], "dim_ordering": "tf", "name": "maxpooling3d_19", "pool_size": [2, 2, 2], "trainable": true, "border_mode": "same"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_119"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_41"}}, {"class_name": "Dense", "config": {"W_constraint": null, "W_regularizer": null, "b_regularizer": null, "name": "dense_1", "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "input_dim": 250, "bias": true, "output_dim": 1000, "b_constraint": null, "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_120"}}, {"class_name": "Dense", "config": {"W_constraint": null, "W_regularizer": null, "b_regularizer": null, "name": "dense_2", "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "input_dim": 1000, "bias": true, "output_dim": 100, "b_constraint": null, "activation": "relu"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_121"}}, {"class_name": "Dense", "config": {"W_constraint": null, "W_regularizer": null, "b_regularizer": null, "name": "softmax", "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "input_dim": 100, "bias": true, "output_dim": 3, "b_constraint": null, "activation": "softmax"}}]}