{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"activation": "relu", "activity_regularizer": null, "border_mode": "same", "W_constraint": null, "trainable": true, "subsample": [1, 1], "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "nb_filter": 10, "batch_input_shape": [null, 10, 10, 10], "nb_row": 10, "dim_ordering": "tf", "b_regularizer": null, "nb_col": 10, "name": "conv1_0", "bias": true, "input_dtype": "float32"}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "activity_regularizer": null, "border_mode": "same", "W_constraint": null, "trainable": true, "name": "conv1_1", "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "nb_filter": 10, "subsample": [1, 1], "dim_ordering": "tf", "b_regularizer": null, "nb_col": 10, "bias": true, "nb_row": 10}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "activity_regularizer": null, "border_mode": "same", "W_constraint": null, "trainable": true, "name": "conv1_2", "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "nb_filter": 10, "subsample": [1, 1], "dim_ordering": "tf", "b_regularizer": null, "nb_col": 10, "bias": true, "nb_row": 10}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "activity_regularizer": null, "border_mode": "same", "W_constraint": null, "trainable": true, "name": "conv1_3", "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "nb_filter": 10, "subsample": [1, 1], "dim_ordering": "tf", "b_regularizer": null, "nb_col": 10, "bias": true, "nb_row": 10}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "activity_regularizer": null, "border_mode": "same", "W_constraint": null, "trainable": true, "name": "convolution2d_23", "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "nb_filter": 10, "subsample": [1, 1], "dim_ordering": "tf", "b_regularizer": null, "nb_col": 10, "bias": true, "nb_row": 10}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "activity_regularizer": null, "border_mode": "same", "W_constraint": null, "trainable": true, "name": "convolution2d_24", "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "nb_filter": 10, "subsample": [1, 1], "dim_ordering": "tf", "b_regularizer": null, "nb_col": 10, "bias": true, "nb_row": 10}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "activity_regularizer": null, "border_mode": "same", "W_constraint": null, "trainable": true, "name": "convolution2d_25", "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "nb_filter": 10, "subsample": [1, 1], "dim_ordering": "tf", "b_regularizer": null, "nb_col": 10, "bias": true, "nb_row": 10}}, {"class_name": "Convolution2D", "config": {"activation": "relu", "activity_regularizer": null, "border_mode": "same", "W_constraint": null, "trainable": true, "name": "convolution2d_26", "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "nb_filter": 10, "subsample": [1, 1], "dim_ordering": "tf", "b_regularizer": null, "nb_col": 10, "bias": true, "nb_row": 10}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2], "trainable": true, "name": "maxpooling2d_10"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_28", "p": 0.5}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_10"}}, {"class_name": "Dense", "config": {"activation": "relu", "activity_regularizer": null, "W_constraint": null, "trainable": true, "output_dim": 1000, "name": "dense_28", "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "bias": true, "b_regularizer": null, "input_dim": 250}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_29", "p": 0.5}}, {"class_name": "Dense", "config": {"activation": "relu", "activity_regularizer": null, "W_constraint": null, "trainable": true, "output_dim": 100, "name": "dense_29", "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "bias": true, "b_regularizer": null, "input_dim": 1000}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_30", "p": 0.5}}, {"class_name": "Dense", "config": {"activation": "sigmoid", "activity_regularizer": null, "W_constraint": null, "trainable": true, "output_dim": 1, "name": "dense_30", "W_regularizer": null, "init": "glorot_uniform", "b_constraint": null, "bias": true, "b_regularizer": null, "input_dim": 100}}]}