{"class_name": "Sequential", "keras_version": "1.1.2", "config": [{"class_name": "Convolution3D", "config": {"b_regularizer": null, "border_mode": "same", "activation": "relu", "W_regularizer": null, "activity_regularizer": null, "trainable": true, "subsample": [1, 1, 1], "bias": true, "dim_ordering": "tf", "kernel_dim3": 10, "input_dtype": "float32", "init": "glorot_uniform", "kernel_dim2": 10, "b_constraint": null, "batch_input_shape": [null, 1, 10, 10, 10], "nb_filter": 10, "name": "conv1_0", "W_constraint": null, "kernel_dim1": 10}}, {"class_name": "Convolution3D", "config": {"b_regularizer": null, "border_mode": "same", "kernel_dim2": 10, "activation": "relu", "W_regularizer": null, "activity_regularizer": null, "subsample": [1, 1, 1], "kernel_dim3": 10, "dim_ordering": "tf", "init": "glorot_uniform", "bias": true, "b_constraint": null, "trainable": true, "nb_filter": 10, "name": "conv1_1", "W_constraint": null, "kernel_dim1": 10}}, {"class_name": "Convolution3D", "config": {"b_regularizer": null, "border_mode": "same", "kernel_dim2": 10, "activation": "relu", "W_regularizer": null, "activity_regularizer": null, "subsample": [1, 1, 1], "kernel_dim3": 10, "dim_ordering": "tf", "init": "glorot_uniform", "bias": true, "b_constraint": null, "trainable": true, "nb_filter": 10, "name": "conv1_2", "W_constraint": null, "kernel_dim1": 10}}, {"class_name": "Convolution3D", "config": {"b_regularizer": null, "border_mode": "same", "kernel_dim2": 10, "activation": "relu", "W_regularizer": null, "activity_regularizer": null, "subsample": [1, 1, 1], "kernel_dim3": 10, "dim_ordering": "tf", "init": "glorot_uniform", "bias": true, "b_constraint": null, "trainable": true, "nb_filter": 10, "name": "conv1_3", "W_constraint": null, "kernel_dim1": 10}}, {"class_name": "MaxPooling3D", "config": {"dim_ordering": "tf", "pool_size": [2, 2, 2], "strides": [2, 2, 2], "trainable": true, "name": "maxpooling3d_22", "border_mode": "same"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_94"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_22"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activation": "relu", "W_regularizer": null, "activity_regularizer": null, "output_dim": 2500, "init": "glorot_uniform", "bias": true, "b_constraint": null, "trainable": true, "name": "dense_1", "W_constraint": null, "input_dim": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_95"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activation": "relu", "W_regularizer": null, "activity_regularizer": null, "output_dim": 1000, "init": "glorot_uniform", "bias": true, "b_constraint": null, "trainable": true, "name": "dense_11", "W_constraint": null, "input_dim": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_96"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activation": "relu", "W_regularizer": null, "activity_regularizer": null, "output_dim": 200, "init": "glorot_uniform", "bias": true, "b_constraint": null, "trainable": true, "name": "dense_2", "W_constraint": null, "input_dim": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_97"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activation": "relu", "W_regularizer": null, "activity_regularizer": null, "output_dim": 100, "init": "glorot_uniform", "bias": true, "b_constraint": null, "trainable": true, "name": "dense_3", "W_constraint": null, "input_dim": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_98"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activation": "relu", "W_regularizer": null, "activity_regularizer": null, "output_dim": 30, "init": "glorot_uniform", "bias": true, "b_constraint": null, "trainable": true, "name": "dense_4", "W_constraint": null, "input_dim": null}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_99"}}, {"class_name": "Dense", "config": {"b_regularizer": null, "activation": "softmax", "W_regularizer": null, "activity_regularizer": null, "output_dim": 3, "init": "glorot_uniform", "bias": true, "b_constraint": null, "trainable": true, "name": "softmax", "W_constraint": null, "input_dim": null}}]}