{"loss": "binary_crossentropy", "sample_weight_mode": null, "config": [{"class_name": "Convolution1D", "config": {"activation": "relu", "bias": true, "subsample_length": 1, "trainable": true, "border_mode": "valid", "filter_length": 10, "init": "uniform", "nb_filter": 100, "W_constraint": null, "W_regularizer": null, "input_dtype": "float32", "input_dim": null, "b_constraint": null, "batch_input_shape": [null, 100, 10], "b_regularizer": null, "activity_regularizer": null, "name": "convolution1d_5", "input_length": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_6", "p": 0.5}}, {"class_name": "Convolution1D", "config": {"activation": "relu", "bias": true, "subsample_length": 1, "trainable": true, "filter_length": 10, "init": "uniform", "nb_filter": 100, "W_constraint": null, "input_dim": null, "border_mode": "valid", "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "name": "convolution1d_6", "input_length": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_7", "p": 0.5}}, {"class_name": "Convolution1D", "config": {"activation": "relu", "bias": true, "subsample_length": 1, "trainable": true, "filter_length": 10, "init": "uniform", "nb_filter": 100, "W_constraint": null, "input_dim": null, "border_mode": "valid", "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "name": "convolution1d_7", "input_length": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_8", "p": 0.5}}, {"class_name": "Convolution1D", "config": {"activation": "relu", "bias": true, "subsample_length": 1, "trainable": true, "filter_length": 10, "init": "uniform", "nb_filter": 100, "W_constraint": null, "input_dim": null, "border_mode": "valid", "W_regularizer": null, "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "name": "convolution1d_8", "input_length": null}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_9", "p": 0.5}}, {"class_name": "MaxPooling1D", "config": {"border_mode": "valid", "trainable": true, "name": "maxpooling1d_2", "stride": 5, "pool_length": 5}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}}, {"class_name": "Dense", "config": {"activation": "relu", "bias": true, "trainable": true, "init": "glorot_uniform", "input_dim": null, "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "output_dim": 4000, "name": "dense_3"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_10", "p": 0.5}}, {"class_name": "Dense", "config": {"activation": "sigmoid", "bias": true, "trainable": true, "init": "glorot_uniform", "input_dim": null, "W_constraint": null, "W_regularizer": null, "activity_regularizer": null, "b_constraint": null, "b_regularizer": null, "output_dim": 1, "name": "dense_4"}}], "class_name": "Sequential", "keras_version": "1.0.6", "optimizer": {"epsilon": 1e-08, "beta_1": 0.8999999761581421, "name": "Adam", "lr": 0.0010000000474974513, "beta_2": 0.9990000128746033}}