{"loss": "binary_crossentropy", "class_name": "Sequential", "sample_weight_mode": null, "keras_version": "1.0.5", "optimizer": {"name": "Adam", "lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "epsilon": 1e-08, "beta_2": 0.9990000128746033}, "config": [{"class_name": "Convolution2D", "config": {"nb_filter": 20, "border_mode": "same", "nb_col": 9, "init": "glorot_uniform", "subsample": [1, 1], "nb_row": 9, "b_constraint": null, "input_dtype": "float32", "W_regularizer": null, "activation": "linear", "W_constraint": null, "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "th", "batch_input_shape": [null, 10, 10, 10], "name": "convolution2d_3", "bias": true, "trainable": true}}, {"class_name": "Convolution2D", "config": {"nb_filter": 20, "border_mode": "valid", "nb_col": 9, "init": "glorot_uniform", "subsample": [1, 1], "nb_row": 9, "W_constraint": null, "W_regularizer": null, "activation": "linear", "b_constraint": null, "b_regularizer": null, "activity_regularizer": null, "dim_ordering": "th", "name": "convolution2d_4", "bias": true, "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "p": 0.1}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true}}, {"class_name": "Dense", "config": {"input_dim": null, "init": "glorot_uniform", "b_constraint": null, "activation": "linear", "bias": true, "W_constraint": null, "W_regularizer": null, "output_dim": 480, "b_regularizer": null, "activity_regularizer": null, "name": "dense_3", "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "p": 0.5}}, {"class_name": "Dense", "config": {"input_dim": null, "init": "glorot_uniform", "b_constraint": null, "activation": "linear", "bias": true, "W_constraint": null, "W_regularizer": null, "output_dim": 1, "b_regularizer": null, "activity_regularizer": null, "name": "dense_4", "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "sigmoid"}}]}