{"keras_version": "1.0.6", "optimizer": {"name": "Adam", "lr": 0.0010000000474974513, "epsilon": 1e-08, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033}, "sample_weight_mode": null, "config": [{"config": {"name": "convolution2d_3", "init": "glorot_uniform", "nb_row": 5, "W_constraint": null, "batch_input_shape": [null, 20, 10, 10], "nb_filter": 100, "W_regularizer": null, "b_constraint": null, "border_mode": "same", "activation": "linear", "trainable": true, "b_regularizer": null, "dim_ordering": "th", "bias": true, "nb_col": 5, "input_dtype": "float32", "activity_regularizer": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "convolution2d_4", "init": "glorot_uniform", "nb_row": 5, "W_constraint": null, "nb_col": 5, "nb_filter": 50, "W_regularizer": null, "b_constraint": null, "border_mode": "valid", "activation": "linear", "trainable": true, "b_regularizer": null, "dim_ordering": "th", "bias": true, "activity_regularizer": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_2", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_3", "p": 0.25, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_2", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_3", "init": "glorot_uniform", "output_dim": 480, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "activation": "linear", "trainable": true, "b_regularizer": null, "input_dim": null, "bias": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "class_name": "Activation"}, {"config": {"name": "dropout_4", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_4", "init": "glorot_uniform", "output_dim": 1, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "activation": "linear", "trainable": true, "b_regularizer": null, "input_dim": null, "bias": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "activation_6", "trainable": true, "activation": "sigmoid"}, "class_name": "Activation"}], "loss": "binary_crossentropy", "class_name": "Sequential"}