{"config": [{"class_name": "Convolution2D", "config": {"nb_row": 9, "init": "glorot_uniform", "border_mode": "same", "input_dtype": "float32", "b_regularizer": null, "b_constraint": null, "nb_col": 9, "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "dim_ordering": "th", "name": "convolution2d_3", "nb_filter": 20, "W_regularizer": null, "bias": true, "batch_input_shape": [null, 10, 10, 20], "activation": "linear", "W_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_5"}}, {"class_name": "Convolution2D", "config": {"nb_row": 9, "init": "glorot_uniform", "border_mode": "valid", "b_regularizer": null, "b_constraint": null, "nb_col": 9, "subsample": [1, 1], "trainable": true, "activity_regularizer": null, "dim_ordering": "th", "name": "convolution2d_4", "nb_filter": 20, "W_regularizer": null, "bias": true, "activation": "linear", "W_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_6"}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "dim_ordering": "th", "name": "maxpooling2d_2", "border_mode": "valid", "strides": [2, 2], "pool_size": [2, 2]}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}}, {"class_name": "Dense", "config": {"input_dim": null, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "trainable": true, "activity_regularizer": null, "name": "dense_3", "output_dim": 480, "activation": "linear", "bias": true, "W_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_7"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"input_dim": null, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "trainable": true, "activity_regularizer": null, "name": "dense_4", "output_dim": 1, "activation": "linear", "bias": true, "W_constraint": null}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_8"}}], "class_name": "Sequential", "loss": "binary_crossentropy", "keras_version": "1.0.5", "sample_weight_mode": null, "optimizer": {"beta_1": 0.8999999761581421, "epsilon": 1e-08, "lr": 0.0010000000474974513, "beta_2": 0.9990000128746033, "name": "Adam"}}