{"keras_version": "1.2.0", "config": [{"config": {"activation": "relu", "input_dtype": "float32", "trainable": true, "nb_filter": 10, "nb_row": 10, "dim_ordering": "tf", "W_regularizer": null, "border_mode": "same", "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "name": "conv1_0", "W_constraint": null, "b_regularizer": null, "subsample": [1, 1], "batch_input_shape": [null, 10, 10, 10], "bias": true, "nb_col": 10}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "nb_row": 5, "trainable": true, "nb_filter": 10, "dim_ordering": "tf", "W_regularizer": null, "border_mode": "same", "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "name": "conv1_1", "W_constraint": null, "b_regularizer": null, "subsample": [1, 1], "bias": true, "nb_col": 5}, "class_name": "Convolution2D"}, {"config": {"activation": "relu", "nb_row": 10, "trainable": true, "nb_filter": 10, "dim_ordering": "tf", "W_regularizer": null, "border_mode": "same", "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "name": "conv1_2", "W_constraint": null, "b_regularizer": null, "subsample": [1, 1], "bias": true, "nb_col": 10}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "trainable": true, "dim_ordering": "tf", "name": "maxpooling2d_6", "border_mode": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_16", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "flatten_6", "trainable": true}, "class_name": "Flatten"}, {"config": {"activation": "relu", "b_regularizer": null, "trainable": true, "output_dim": 1000, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "name": "dense_16", "bias": true, "input_dim": 250, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_17", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"activation": "relu", "b_regularizer": null, "trainable": true, "output_dim": 100, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "name": "dense_17", "bias": true, "input_dim": 1000, "W_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_18", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"activation": "sigmoid", "b_regularizer": null, "trainable": true, "output_dim": 1, "b_constraint": null, "activity_regularizer": null, "init": "glorot_uniform", "W_constraint": null, "name": "dense_18", "bias": true, "input_dim": 100, "W_regularizer": null}, "class_name": "Dense"}], "class_name": "Sequential"}