{"sample_weight_mode": null, "config": [{"config": {"W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "input_dtype": "float32", "name": "conv1_0", "trainable": true, "subsample": [1, 1], "W_regularizer": null, "bias": true, "nb_filter": 20, "activity_regularizer": null, "border_mode": "same", "b_regularizer": null, "dim_ordering": "tf", "nb_col": 10, "batch_input_shape": [null, 10, 10, 20], "activation": "relu", "nb_row": 10}, "class_name": "Convolution2D"}, {"config": {"W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "name": "conv1_1", "trainable": true, "subsample": [1, 1], "W_regularizer": null, "bias": true, "nb_filter": 20, "activity_regularizer": null, "border_mode": "same", "b_regularizer": null, "dim_ordering": "tf", "nb_col": 5, "activation": "relu", "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "name": "conv1_2", "trainable": true, "subsample": [1, 1], "W_regularizer": null, "bias": true, "nb_filter": 20, "activity_regularizer": null, "border_mode": "same", "b_regularizer": null, "dim_ordering": "tf", "nb_col": 10, "activation": "relu", "nb_row": 10}, "class_name": "Convolution2D"}, {"config": {"pool_size": [4, 4], "dim_ordering": "tf", "name": "maxpooling2d_13", "trainable": true, "strides": [1, 1], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_44", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "input_dtype": "float32", "name": "conv2_0", "trainable": true, "subsample": [1, 1], "W_regularizer": null, "bias": true, "nb_filter": 20, "activity_regularizer": null, "border_mode": "same", "b_regularizer": null, "dim_ordering": "tf", "nb_col": 10, "batch_input_shape": [null, 10, 10, 20], "activation": "relu", "nb_row": 10}, "class_name": "Convolution2D"}, {"config": {"W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "name": "conv2_1", "trainable": true, "subsample": [1, 1], "W_regularizer": null, "bias": true, "nb_filter": 20, "activity_regularizer": null, "border_mode": "same", "b_regularizer": null, "dim_ordering": "tf", "nb_col": 5, "activation": "relu", "nb_row": 5}, "class_name": "Convolution2D"}, {"config": {"W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "name": "conv2_2", "trainable": true, "subsample": [1, 1], "W_regularizer": null, "bias": true, "nb_filter": 20, "activity_regularizer": null, "border_mode": "same", "b_regularizer": null, "dim_ordering": "tf", "nb_col": 10, "activation": "relu", "nb_row": 10}, "class_name": "Convolution2D"}, {"config": {"pool_size": [4, 4], "dim_ordering": "tf", "name": "maxpooling2d_14", "trainable": true, "strides": [1, 1], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_45", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"name": "flatten_15", "trainable": true}, "class_name": "Flatten"}, {"config": {"input_dim": null, "W_constraint": null, "b_constraint": null, "output_dim": 200, "name": "dense_37", "trainable": true, "W_regularizer": null, "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"name": "dropout_46", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"input_dim": null, "W_constraint": null, "b_constraint": null, "output_dim": 100, "name": "dense_38", "trainable": true, "W_regularizer": null, "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"name": "dropout_47", "trainable": true, "p": 0.5}, "class_name": "Dropout"}, {"config": {"input_dim": null, "W_constraint": null, "b_constraint": null, "output_dim": 1, "name": "dense_39", "trainable": true, "W_regularizer": null, "bias": true, "init": "glorot_uniform", "activity_regularizer": null, "b_regularizer": null, "activation": "sigmoid"}, "class_name": "Dense"}], "class_name": "Sequential", "loss": "binary_crossentropy", "keras_version": "1.0.6", "optimizer": {"beta_1": 0.8999999761581421, "name": "Adam", "beta_2": 0.9990000128746033, "epsilon": 1e-08, "lr": 0.0010000000474974513}}