{"sample_weight_mode": null, "class_name": "Sequential", "optimizer": {"name": "Adam", "beta_1": 0.8999999761581421, "lr": 0.0010000000474974513, "epsilon": 1e-08, "beta_2": 0.9990000128746033}, "keras_version": "1.0.6", "config": [{"class_name": "Convolution2D", "config": {"border_mode": "same", "init": "glorot_uniform", "input_dtype": "float32", "name": "conv1_0", "b_regularizer": null, "W_constraint": null, "nb_col": 10, "trainable": true, "activity_regularizer": null, "nb_filter": 10, "batch_input_shape": [null, 10, 10, 10], "nb_row": 10, "bias": true, "W_regularizer": null, "activation": "relu", "b_constraint": null, "subsample": [1, 1], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"border_mode": "same", "init": "glorot_uniform", "name": "conv1_1", "b_regularizer": null, "W_constraint": null, "nb_col": 10, "trainable": true, "activity_regularizer": null, "nb_filter": 10, "nb_row": 10, "bias": true, "W_regularizer": null, "activation": "relu", "b_constraint": null, "subsample": [1, 1], "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"border_mode": "same", "init": "glorot_uniform", "name": "conv1_2", "b_regularizer": null, "W_constraint": null, "nb_col": 5, "trainable": true, "activity_regularizer": null, "nb_filter": 10, "nb_row": 5, "bias": true, "W_regularizer": null, "activation": "relu", "b_constraint": null, "subsample": [1, 1], "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_4", "p": 0.2}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "name": "dense_4", "b_regularizer": null, "W_constraint": null, "trainable": true, "activity_regularizer": null, "input_dim": null, "bias": true, "W_regularizer": null, "activation": "relu", "b_constraint": null, "output_dim": 200}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_5", "p": 0.5}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "name": "dense_5", "b_regularizer": null, "W_constraint": null, "trainable": true, "activity_regularizer": null, "input_dim": null, "bias": true, "W_regularizer": null, "activation": "relu", "b_constraint": null, "output_dim": 100}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_6", "p": 0.5}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "name": "dense_6", "b_regularizer": null, "W_constraint": null, "trainable": true, "activity_regularizer": null, "input_dim": null, "bias": true, "W_regularizer": null, "activation": "sigmoid", "b_constraint": null, "output_dim": 3}}], "loss": "categorical_crossentropy"}