{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"input_dtype": "float32", "nb_row": 10, "W_constraint": null, "name": "conv1_0", "W_regularizer": null, "b_regularizer": null, "subsample": [1, 1], "activation": "relu", "dim_ordering": "tf", "b_constraint": null, "bias": true, "init": "glorot_uniform", "batch_input_shape": [null, 10, 10, 10], "activity_regularizer": null, "nb_col": 10, "trainable": true, "border_mode": "same", "nb_filter": 10}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_row": 10, "name": "conv1_1", "W_constraint": null, "b_regularizer": null, "activation": "relu", "dim_ordering": "tf", "b_constraint": null, "bias": true, "init": "glorot_uniform", "subsample": [1, 1], "activity_regularizer": null, "nb_col": 10, "trainable": true, "border_mode": "same", "nb_filter": 10}}, {"class_name": "Convolution2D", "config": {"W_regularizer": null, "nb_row": 5, "name": "conv1_2", "W_constraint": null, "b_regularizer": null, "activation": "relu", "dim_ordering": "tf", "b_constraint": null, "bias": true, "init": "glorot_uniform", "subsample": [1, 1], "activity_regularizer": null, "nb_col": 5, "trainable": true, "border_mode": "same", "nb_filter": 10}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "dropout_4"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_2"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "input_dim": 1000, "W_constraint": null, "name": "dense_4", "b_regularizer": null, "activation": "relu", "b_constraint": null, "bias": true, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "output_dim": 200}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_5"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "input_dim": 200, "W_constraint": null, "name": "dense_5", "b_regularizer": null, "activation": "relu", "b_constraint": null, "bias": true, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "output_dim": 100}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "dropout_6"}}, {"class_name": "Dense", "config": {"W_regularizer": null, "input_dim": 100, "W_constraint": null, "name": "dense_6", "b_regularizer": null, "activation": "sigmoid", "b_constraint": null, "bias": true, "init": "glorot_uniform", "trainable": true, "activity_regularizer": null, "output_dim": 3}}]}