{"keras_version": "1.0.6", "class_name": "Sequential", "loss": "categorical_crossentropy", "config": [{"config": {"batch_input_shape": [null, 10, 10, 10], "activation": "relu", "border_mode": "same", "b_regularizer": null, "nb_row": 10, "bias": true, "input_dtype": "float32", "W_regularizer": null, "nb_col": 10, "activity_regularizer": null, "name": "conv1_0", "trainable": true, "b_constraint": null, "W_constraint": null, "nb_filter": 10, "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"padding": [2, 2], "trainable": true, "name": "zeropadding2d_2"}, "class_name": "ZeroPadding2D"}, {"config": {"activity_regularizer": null, "activation": "relu", "border_mode": "same", "nb_row": 5, "bias": true, "b_constraint": null, "nb_col": 5, "b_regularizer": null, "name": "conv1_1", "trainable": true, "W_constraint": null, "W_regularizer": null, "nb_filter": 10, "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"activity_regularizer": null, "activation": "relu", "border_mode": "same", "nb_row": 10, "bias": true, "b_constraint": null, "nb_col": 10, "b_regularizer": null, "name": "conv1_2", "trainable": true, "W_constraint": null, "W_regularizer": null, "nb_filter": 10, "init": "glorot_uniform", "dim_ordering": "tf", "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"strides": [1, 1], "border_mode": "valid", "pool_size": [4, 4], "trainable": true, "name": "maxpooling2d_2", "dim_ordering": "tf"}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_4"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_2"}, "class_name": "Flatten"}, {"config": {"b_regularizer": null, "activation": "relu", "bias": true, "b_constraint": null, "activity_regularizer": null, "name": "dense_4", "trainable": true, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "input_dim": null, "output_dim": 200}, "class_name": "Dense"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_5"}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "activation": "relu", "bias": true, "b_constraint": null, "activity_regularizer": null, "name": "dense_5", "trainable": true, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "input_dim": null, "output_dim": 100}, "class_name": "Dense"}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_6"}, "class_name": "Dropout"}, {"config": {"b_regularizer": null, "activation": "sigmoid", "bias": true, "b_constraint": null, "activity_regularizer": null, "name": "dense_6", "trainable": true, "W_constraint": null, "W_regularizer": null, "init": "glorot_uniform", "input_dim": null, "output_dim": 3}, "class_name": "Dense"}], "sample_weight_mode": null, "optimizer": {"beta_2": 0.9990000128746033, "epsilon": 1e-08, "lr": 0.0010000000474974513, "beta_1": 0.8999999761581421, "name": "Adam"}}