{"config": [{"class_name": "Convolution3D", "config": {"kernel_dim3": 18, "kernel_dim2": 9, "init": "glorot_uniform", "border_mode": "same", "input_dtype": "float32", "b_regularizer": null, "b_constraint": null, "kernel_dim1": 9, "subsample": [1, 1, 1], "trainable": true, "activity_regularizer": null, "dim_ordering": "th", "name": "convolution3d_10", "nb_filter": 20, "W_regularizer": null, "bias": true, "batch_input_shape": [null, 1, 10, 10, 20], "activation": "linear", "W_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_21"}}, {"class_name": "Convolution3D", "config": {"b_regularizer": null, "kernel_dim3": 19, "kernel_dim2": 9, "init": "glorot_uniform", "border_mode": "valid", "W_regularizer": null, "kernel_dim1": 9, "subsample": [1, 1, 1], "trainable": true, "activity_regularizer": null, "dim_ordering": "th", "name": "convolution3d_11", "b_constraint": null, "activation": "linear", "bias": true, "W_constraint": null, "nb_filter": 20}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_22"}}, {"class_name": "MaxPooling3D", "config": {"trainable": true, "dim_ordering": "th", "name": "maxpooling3d_4", "border_mode": "valid", "strides": [2, 2, 2], "pool_size": [2, 2, 2]}}, {"class_name": "Dropout", "config": {"p": 0.25, "trainable": true, "name": "dropout_9"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_6"}}, {"class_name": "Dense", "config": {"input_dim": null, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "trainable": true, "activity_regularizer": null, "name": "dense_11", "output_dim": 480, "activation": "linear", "bias": true, "W_constraint": null}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_23"}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_10"}}, {"class_name": "Dense", "config": {"input_dim": null, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "trainable": true, "activity_regularizer": null, "name": "dense_12", "output_dim": 1, "activation": "linear", "bias": true, "W_constraint": null}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_24"}}], "class_name": "Sequential", "loss": "binary_crossentropy", "keras_version": "1.0.5", "sample_weight_mode": null, "optimizer": {"beta_1": 0.8999999761581421, "epsilon": 1e-08, "lr": 0.0010000000474974513, "beta_2": 0.9990000128746033, "name": "Adam"}}