{"config": [{"config": {"nb_filter": 20, "subsample": [1, 1], "trainable": true, "nb_row": 10, "b_constraint": null, "b_regularizer": null, "border_mode": "same", "dim_ordering": "tf", "nb_col": 10, "W_regularizer": null, "input_dtype": "float32", "name": "conv1_0", "batch_input_shape": [null, 10, 10, 20], "init": "glorot_uniform", "activity_regularizer": null, "activation": "relu", "W_constraint": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 20, "subsample": [1, 1], "trainable": true, "b_constraint": null, "b_regularizer": null, "border_mode": "same", "dim_ordering": "tf", "nb_col": 5, "W_regularizer": null, "name": "conv1_1", "nb_row": 5, "init": "glorot_uniform", "activity_regularizer": null, "activation": "relu", "W_constraint": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"nb_filter": 20, "subsample": [1, 1], "trainable": true, "b_constraint": null, "b_regularizer": null, "border_mode": "same", "dim_ordering": "tf", "nb_col": 10, "W_regularizer": null, "name": "conv1_2", "nb_row": 10, "init": "glorot_uniform", "activity_regularizer": null, "activation": "relu", "W_constraint": null, "bias": true}, "class_name": "Convolution2D"}, {"config": {"trainable": true, "name": "dropout_4", "p": 0.5}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_2"}, "class_name": "Flatten"}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "input_dim": null, "output_dim": 200, "name": "dense_4", "activity_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_5", "p": 0.5}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "input_dim": null, "output_dim": 100, "name": "dense_5", "activity_regularizer": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"trainable": true, "name": "dropout_6", "p": 0.5}, "class_name": "Dropout"}, {"config": {"W_constraint": null, "bias": true, "trainable": true, "b_constraint": null, "b_regularizer": null, "W_regularizer": null, "init": "glorot_uniform", "input_dim": null, "output_dim": 2, "name": "dense_6", "activity_regularizer": null, "activation": "sigmoid"}, "class_name": "Dense"}], "keras_version": "1.0.6", "optimizer": {"epsilon": 1e-08, "beta_2": 0.9990000128746033, "beta_1": 0.8999999761581421, "name": "Adam", "lr": 0.0010000000474974513}, "loss": "binary_crossentropy", "class_name": "Sequential", "sample_weight_mode": null}