{"keras_version": "1.0.6", "optimizer": {"name": "Adam", "lr": 0.0010000000474974513, "epsilon": 1e-08, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033}, "sample_weight_mode": null, "config": [{"config": {"name": "zeropadding2d_18", "padding": [1, 1], "trainable": true, "batch_input_shape": [null, 20, 10, 10], "input_dtype": "float32"}, "class_name": "ZeroPadding2D"}, {"config": {"name": "convolution2d_22", "init": "glorot_uniform", "nb_row": 3, "W_constraint": null, "nb_col": 3, "nb_filter": 64, "W_regularizer": null, "b_constraint": null, "border_mode": "valid", "activation": "relu", "trainable": true, "b_regularizer": null, "dim_ordering": "th", "bias": true, "activity_regularizer": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "zeropadding2d_19", "padding": [1, 1], "trainable": true}, "class_name": "ZeroPadding2D"}, {"config": {"name": "convolution2d_23", "init": "glorot_uniform", "nb_row": 3, "W_constraint": null, "nb_col": 3, "nb_filter": 64, "W_regularizer": null, "b_constraint": null, "border_mode": "valid", "activation": "relu", "trainable": true, "b_regularizer": null, "dim_ordering": "th", "bias": true, "activity_regularizer": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_10", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "zeropadding2d_20", "padding": [1, 1], "trainable": true}, "class_name": "ZeroPadding2D"}, {"config": {"name": "convolution2d_24", "init": "glorot_uniform", "nb_row": 3, "W_constraint": null, "nb_col": 3, "nb_filter": 128, "W_regularizer": null, "b_constraint": null, "border_mode": "valid", "activation": "relu", "trainable": true, "b_regularizer": null, "dim_ordering": "th", "bias": true, "activity_regularizer": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "zeropadding2d_21", "padding": [1, 1], "trainable": true}, "class_name": "ZeroPadding2D"}, {"config": {"name": "convolution2d_25", "init": "glorot_uniform", "nb_row": 3, "W_constraint": null, "nb_col": 3, "nb_filter": 128, "W_regularizer": null, "b_constraint": null, "border_mode": "valid", "activation": "relu", "trainable": true, "b_regularizer": null, "dim_ordering": "th", "bias": true, "activity_regularizer": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_11", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "zeropadding2d_22", "padding": [1, 1], "trainable": true}, "class_name": "ZeroPadding2D"}, {"config": {"name": "convolution2d_26", "init": "glorot_uniform", "nb_row": 3, "W_constraint": null, "nb_col": 3, "nb_filter": 256, "W_regularizer": null, "b_constraint": null, "border_mode": "valid", "activation": "relu", "trainable": true, "b_regularizer": null, "dim_ordering": "th", "bias": true, "activity_regularizer": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "zeropadding2d_23", "padding": [1, 1], "trainable": true}, "class_name": "ZeroPadding2D"}, {"config": {"name": "convolution2d_27", "init": "glorot_uniform", "nb_row": 3, "W_constraint": null, "nb_col": 3, "nb_filter": 256, "W_regularizer": null, "b_constraint": null, "border_mode": "valid", "activation": "relu", "trainable": true, "b_regularizer": null, "dim_ordering": "th", "bias": true, "activity_regularizer": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "zeropadding2d_24", "padding": [1, 1], "trainable": true}, "class_name": "ZeroPadding2D"}, {"config": {"name": "convolution2d_28", "init": "glorot_uniform", "nb_row": 3, "W_constraint": null, "nb_col": 3, "nb_filter": 256, "W_regularizer": null, "b_constraint": null, "border_mode": "valid", "activation": "relu", "trainable": true, "b_regularizer": null, "dim_ordering": "th", "bias": true, "activity_regularizer": null, "subsample": [1, 1]}, "class_name": "Convolution2D"}, {"config": {"name": "maxpooling2d_12", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid"}, "class_name": "MaxPooling2D"}, {"config": {"name": "flatten_4", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_8", "init": "glorot_uniform", "output_dim": 4096, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "activation": "relu", "trainable": true, "b_regularizer": null, "input_dim": null, "bias": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_7", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_9", "init": "glorot_uniform", "output_dim": 4096, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "activation": "relu", "trainable": true, "b_regularizer": null, "input_dim": null, "bias": true, "activity_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "dropout_8", "p": 0.5, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "dense_10", "init": "glorot_uniform", "output_dim": 1, "W_constraint": null, "W_regularizer": null, "b_constraint": null, "activation": "sigmoid", "trainable": true, "b_regularizer": null, "input_dim": null, "bias": true, "activity_regularizer": null}, "class_name": "Dense"}], "loss": "binary_crossentropy", "class_name": "Sequential"}